Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Финдиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Организации/Ext/ManagerModule.bsl
// Возвращает организацию по умолчанию.
// Если в ИБ есть только одна организация, которая не помечена на удаление и не является предопределенной,
// то будет возвращена ссылка на нее, иначе будет возвращена пустая ссылка.
//
// Возвращаемое значение:
//     СправочникСсылка.Организации - ссылка на организацию.
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Организация = Справочники.Организации.ПустаяСсылка();
	
	Возврат Организация;

КонецФункции


Функция ПолучитьДанныеОрганизации(Организация = Неопределено, Параметр = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		|	Организации.Финдиректор КАК Финдиректор
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОсновнаяОрганизация";
	
	Если НЕ Организация = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организации.ОсновнаяОрганизация", "Организации.Ссылка = &Организация"); 
        Запрос.УстановитьПараметр("Организация", Организация);

	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяСсылкаСотрудники = Справочники.Сотрудники.ПустаяСсылка();
	
	СтруктураВозврата = Новый Структура("Финдиректор", ПустаяСсылкаСотрудники);
	
	
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Если Параметр = Неопределено Тогда
		Возврат СтруктураВозврата; 
	КонецЕсли; 
	
	Если СтруктураВозврата.Свойство(Параметр) Тогда
		Возврат СтруктураВозврата[Параметр];	
	КонецЕсли;
	
	Возврат ПустаяСсылкаСотрудники;
	
КонецФункции 

Функция ПолучитьФиндиректораОрганизации(Организация = Неопределено, ВозвращатьПользователя = Истина) Экспорт

	Возврат омСотрудники.ПолучитьПользователяПоСотруднтку(Справочники.Организации.ПолучитьДанныеОрганизации(Организация, "Финдиректор"));	

КонецФункции // ПолучитьФиндиректораОрганизации()
